JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
/*
 *  M-Stack USB Device Stack Implementation
 *  Copyright (C) 2013 Alan Ott <alan@signal11.us>
 *  Copyright (C) 2013 Signal 11 Software
 *
 *  Initial version for PIC18, 2008-02-24
 *  PIC24 port, 2013-04-08
 *
 *  M-Stack is free software: you can redistribute it and/or modify it under
 *  the terms of the GNU Lesser General Public License as published by the
 *  Free Software Foundation, version 3; or the Apache License, version 2.0
 *  as published by the Apache Software Foundation.  If you have purchased a
 *  commercial license for this software from Signal 11 Software, your
 *  commerical license superceeds the information in this header.
 *
 *  M-Stack is distributed in the hope that it will be useful, but WITHOUT
 *  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 *  FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public
 *  License for more details.
 *
 *  You should have received a copy of the GNU Lesser General Public License
 *  along with this software.  If not, see <http://www.gnu.org/licenses/>.
 *
 *  You should have received a copy of the Apache License, verion 2.0 along
 *  with this software.  If not, see <http://www.apache.org/licenses/>.
 */

#ifdef __XC32__
#include <xc.h>
#include <sys/kmem.h>
#elif __XC16__
#include <libpic30.h>
#include <xc.h>
#elif __C18
#include <p18f4550.h>
#include <delays.h>
#elif __XC8
#include <xc.h>
#else
#error "Compiler not supported"
#endif

#include <string.h>

#include "usb_config.h"
#include "usb.h"
#include "usb_hal.h"
#include "usb_ch9.h"
#include "usb_microsoft.h"
#include "usb_winusb.h"
#include "../uart.h"

#if _PIC14E && __XC8
	/* This is necessary to avoid a warning about ep0_data_stage_callback
	 * never being assigned to anything other than NULL. Since this is a
	 * library, it's possible (and likely) that the application will not
	 * make use of data stage callbacks, or control transfers at all. This
	 * is only an issue on PIC16F parts (so far) on XC8.
	 */
	#pragma warning disable 1088
#endif

#ifdef __XC8
	/* XC8 gives bogus warnings (at least on PIC18) about
	 * ep0_data_stage_callback() being called when NULL. The code does
	 * check for NULL, and is safe. */
	#pragma warning disable 1471
#endif

#define MIN(x,y) (((x)<(y))?(x):(y))

/* Even though they're the same, It's convenient below (for the buffer
 * macros) to have separate #defines for IN and OUT EP 0 lengths which
 * match the format of the other endpoint length #defines. */
#define EP_0_OUT_LEN EP_0_LEN
#define EP_0_IN_LEN  EP_0_LEN

#ifndef PPB_MODE
	#error "PPB_MODE not defined. Define it to one of the four PPB_* macros in usb_hal.h"
#endif

#ifdef USB_FULL_PING_PONG_ONLY
	#if PPB_MODE != PPB_ALL
		#error "This hardware only supports PPB_ALL"
	#endif
#endif


#if PPB_MODE == PPB_EPO_OUT_ONLY
	#define PPB_EP0_OUT
	#undef  PPB_EP0_IN
	#undef  PPB_EPn
#elif PPB_MODE == PPB_EPN_ONLY
	#undef  PPB_EP0_OUT
	#undef  PPB_EP0_IN
	#define PPB_EPn
#elif PPB_MODE == PPB_NONE
	#undef PPB_EP0_OUT
	#undef PPB_EP0_IN
	#undef PPB_EPn
#elif PPB_MODE == PPB_ALL
	#define PPB_EP0_OUT
	#define PPB_EP0_IN
	#define PPB_EPn
#else
	#error "Must select a valid PPB_MODE"
#endif

STATIC_SIZE_CHECK_EQUAL(sizeof(struct endpoint_descriptor), 7);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct interface_descriptor), 9);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct configuration_descriptor), 9);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct device_descriptor), 18);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct interface_association_descriptor), 8);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct setup_packet), 8);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct microsoft_os_descriptor), 18);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct microsoft_extended_compat_header), 16);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct microsoft_extended_compat_function), 24);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct microsoft_extended_properties_header), 10);
STATIC_SIZE_CHECK_EQUAL(sizeof(struct microsoft_extended_property_section_header), 8);
#ifdef __XC32__
STATIC_SIZE_CHECK_EQUAL(sizeof(struct buffer_descriptor), 8);
#else
STATIC_SIZE_CHECK_EQUAL(sizeof(struct buffer_descriptor), 4);
#endif

#ifdef __C18
/* The buffer descriptors. Per the PIC18F4550 Data sheet, when _not_ using
   ping-pong buffering, these must be laid out sequentially starting at
   address 0x0400 in the following order, ep0_out, ep0_in,ep1_out, ep1_in,
   etc. These must be initialized prior to use. */
#pragma udata buffer_descriptors=BD_ADDR
#endif


/* Calculate the number of Buffer Descriptor pairs, which depends on the
   ping-pong modes active and the number of endpoints used. */
#if defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define NUM_BD_0 4
#elif !defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define NUM_BD_0 3
#elif !defined(PPB_EP0_IN) && !defined(PPB_EP0_OUT)
	#define NUM_BD_0 2
#else
	#error "Nonsense condition detected"
#endif

#ifdef PPB_EPn
	#define NUM_BD (4 * (NUM_ENDPOINT_NUMBERS) + NUM_BD_0)
#else
	#define NUM_BD (2 * (NUM_ENDPOINT_NUMBERS) + NUM_BD_0)
#endif

/* Macros to access a specific buffer descriptor, which depends on the
   ping-pong modes active. Since EP 0 can have a different ping-pong mode
   than the other endpoints, EP0's buffer descriptor should be accessed through
   BDS0OUT() and BDS0IN() only. It is not valid to call BDSnOUT(0,oe), for
   example*/
#if PPB_MODE == PPB_EPO_OUT_ONLY
	#define BDS0OUT(oe) bds[0 + oe]
	#define BDS0IN(oe) bds[2]
	#define BDSnOUT(EP,oe) bds[(EP) * 2 + 1]
	#define BDSnIN(EP,oe) bds[(EP) * 2 + 2]
#elif PPB_MODE == PPB_EPN_ONLY
	#define BDS0OUT(oe) bds[0]
	#define BDS0IN(oe) bds[1]
	#define BDSnOUT(EP,oe) bds[(EP) * 4 - 2 + (oe)]
	#define BDSnIN(EP,oe) bds[(EP) * 4 + (oe)]
#elif PPB_MODE == PPB_NONE
	#define BDS0OUT(oe) bds[0]
	#define BDS0IN(oe) bds[1]
	#define BDSnOUT(EP,oe) bds[(EP) * 2]
	#define BDSnIN(EP,oe) bds[(EP) * 2 + 1]
#elif PPB_MODE == PPB_ALL
	#define BDS0OUT(oe) bds[0 + oe]
	#define BDS0IN(oe) bds[2 + oe]
	#define BDSnOUT(EP,oe) bds[(EP) * 4 + (oe)]
	#define BDSnIN(EP,oe) bds[(EP) * 4 + 2 + (oe)]
#else
#error "Must select a valid PPB_MODE"
#endif

#if defined(AUTOMATIC_WINUSB_SUPPORT) && !defined(MICROSOFT_OS_DESC_VENDOR_CODE)
#error "Must define a MICROSOFT_OS_DESC_VENDOR_CODE for Automatic WinUSB"
#endif

#ifdef AUTOMATIC_WINUSB_SUPPORT
	/* Make sure the Microsoft descriptor functions aren't defined */
	#ifdef MICROSOFT_COMPAT_ID_DESCRIPTOR_FUNC
		#error "Must not define MICROSOFT_COMPAT_ID_DESCRIPTOR_FUNC when using Automatic WinUSB"
	#endif
	#ifdef MICROSOFT_CUSTOM_PROPERTY_DESCRIPTOR_FUNC
		#error "Must not define MICROSOFT_CUSTOM_PROPERTY_DESCRIPTOR_FUNC when using Automatic WinUSB"
	#endif

	/* Define the Microsoft descriptor functions to the handlers
	 * implemented in usb_winusb.c */
	#define MICROSOFT_COMPAT_ID_DESCRIPTOR_FUNC m_stack_winusb_get_microsoft_compat
	#define MICROSOFT_CUSTOM_PROPERTY_DESCRIPTOR_FUNC m_stack_winusb_get_microsoft_property
#endif

static struct buffer_descriptor bds[NUM_BD] BD_ATTR_TAG;

