JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
#ifdef __C18
/* The actual buffers to and from which the data is transferred from the SIE
   (from the USB bus). These buffers must fully be located between addresses
   0x400 and 0x7FF per the datasheet.*/
/* This addr is for the PIC18F4550 */
#pragma udata usb_buffers=0x500
#elif defined(__XC16__) || defined(__XC32__)
	/* Buffers can go anywhere on PIC24/PIC32 parts which are supported
	   (so far). */
#elif __XC8
	/* Addresses are set by BD_ADDR and BUF_ADDR below. */
#else
	#error compiler not supported
#endif

static struct {
/* Set up the EP_BUF() macro for EP0 */
#if defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define EP_BUF(n) \
		unsigned char ep_##n##_out_buf[2][EP_##n##_OUT_LEN]; \
		unsigned char ep_##n##_in_buf[2][EP_##n##_IN_LEN];
#elif !defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define EP_BUF(n) \
		unsigned char ep_##n##_out_buf[2][EP_##n##_OUT_LEN]; \
		unsigned char ep_##n##_in_buf[1][EP_##n##_IN_LEN];
#elif !defined(PPB_EP0_IN) && !defined(PPB_EP0_OUT)
	#define EP_BUF(n) \
		unsigned char ep_##n##_out_buf[1][EP_##n##_OUT_LEN]; \
		unsigned char ep_##n##_in_buf[1][EP_##n##_IN_LEN];
#else
	#error "Nonsense condition detected"
#endif

#if NUM_ENDPOINT_NUMBERS >= 0
	EP_BUF(0)
#endif

/* Re-setup the EP_BUF() macro for the rest of the endpoints */
#undef EP_BUF
#ifdef PPB_EPn
	#define EP_BUF(n) \
		unsigned char ep_##n##_out_buf[2][EP_##n##_OUT_LEN]; \
		unsigned char ep_##n##_in_buf[2][EP_##n##_IN_LEN];
#else
	#define EP_BUF(n) \
		unsigned char ep_##n##_out_buf[1][EP_##n##_OUT_LEN]; \
		unsigned char ep_##n##_in_buf[1][EP_##n##_IN_LEN];
#endif

#if NUM_ENDPOINT_NUMBERS >= 1
	EP_BUF(1)
#endif
#if NUM_ENDPOINT_NUMBERS >= 2
	EP_BUF(2)
#endif
#if NUM_ENDPOINT_NUMBERS >= 3
	EP_BUF(3)
#endif
#if NUM_ENDPOINT_NUMBERS >= 4
	EP_BUF(4)
#endif
#if NUM_ENDPOINT_NUMBERS >= 5
	EP_BUF(5)
#endif
#if NUM_ENDPOINT_NUMBERS >= 6
	EP_BUF(6)
#endif
#if NUM_ENDPOINT_NUMBERS >= 7
	EP_BUF(7)
#endif
#if NUM_ENDPOINT_NUMBERS >= 8
	EP_BUF(8)
#endif
#if NUM_ENDPOINT_NUMBERS >= 9
	EP_BUF(9)
#endif
#if NUM_ENDPOINT_NUMBERS >= 10
	EP_BUF(10)
#endif
#if NUM_ENDPOINT_NUMBERS >= 11
	EP_BUF(11)
#endif
#if NUM_ENDPOINT_NUMBERS >= 12
	EP_BUF(12)
#endif
#if NUM_ENDPOINT_NUMBERS >= 13
	EP_BUF(13)
#endif
#if NUM_ENDPOINT_NUMBERS >= 14
	EP_BUF(14)
#endif
#if NUM_ENDPOINT_NUMBERS >= 15
	EP_BUF(15)
#endif

#undef EP_BUF
} ep_buffers XC8_BUFFER_ADDR_TAG;

struct ep_buf {
	unsigned char * const out; /* buffers for the even buffer descriptor */
	unsigned char * const in;  /* ie: ppbi = 0 */
#ifdef PPB_EPn
	unsigned char * const out1; /* buffers for the odd buffer descriptor */
	unsigned char * const in1;  /* ie: ppbi = 1 */
#endif
	const uint8_t out_len;
	const uint8_t in_len;

#define EP_OUT_HALT_FLAG 0x1
#define EP_IN_HALT_FLAG 0x2
#define EP_RX_DTS 0x4  /* The DTS of the _next_ packet */
#define EP_TX_DTS 0x8
#define EP_RX_PPBI 0x10 /* Represents the next buffer which will be need to be
                           reset and given back to the SIE. */
#define EP_TX_PPBI 0x20 /* Represents the _next_ buffer to write into. */
	uint8_t flags;
};

struct ep0_buf {
	unsigned char * const out; /* buffers for the even buffer descriptor */
	unsigned char * const in;  /* ie: ppbi = 0 */
#ifdef PPB_EP0_OUT
	unsigned char * const out1; /* buffer for the odd buffer descriptor */
#endif
#ifdef PPB_EP0_IN
	unsigned char * const in1;  /* buffer for the odd buffer descriptor */
#endif

	/* Use the EP_* flags from ep_buf for flags */
	uint8_t flags;
};

#ifdef __C18
#pragma idata
#endif

#if defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define EP_BUFS0() { ep_buffers.ep_0_out_buf[0], \
	                     ep_buffers.ep_0_in_buf[0], \
	                     ep_buffers.ep_0_out_buf[1], \
	                     ep_buffers.ep_0_in_buf[1] }

#elif !defined(PPB_EP0_IN) && defined(PPB_EP0_OUT)
	#define EP_BUFS0() { ep_buffers.ep_0_out_buf[0], \
	                     ep_buffers.ep_0_in_buf[0], \
	                     ep_buffers.ep_0_out_buf[1] }

#elif !defined(PPB_EP0_IN) && !defined(PPB_EP0_OUT)
	#define EP_BUFS0() { ep_buffers.ep_0_out_buf[0], \
	                     ep_buffers.ep_0_in_buf[0] }

#else
	#error "Nonsense condition detected"
#endif


#ifdef PPB_EPn
	#define EP_BUFS(n) { ep_buffers.ep_##n##_out_buf[0], \
	                     ep_buffers.ep_##n##_in_buf[0], \
	                     ep_buffers.ep_##n##_out_buf[1], \
	                     ep_buffers.ep_##n##_in_buf[1], \
	                     EP_##n##_OUT_LEN, \
	                     EP_##n##_IN_LEN },
#else
	#define EP_BUFS(n) { ep_buffers.ep_##n##_out_buf[0], \
	                     ep_buffers.ep_##n##_in_buf[0], \
	                     EP_##n##_OUT_LEN, \
	                     EP_##n##_IN_LEN },
#endif

static struct ep0_buf ep0_buf = EP_BUFS0();

static struct ep_buf ep_buf[NUM_ENDPOINT_NUMBERS+1] = {
#if NUM_ENDPOINT_NUMBERS >= 0
	{ NULL, NULL },
	/* TODO wasted space here */
#endif
#if NUM_ENDPOINT_NUMBERS >= 1
	EP_BUFS(1)
#endif
#if NUM_ENDPOINT_NUMBERS >= 2
	EP_BUFS(2)
#endif
#if NUM_ENDPOINT_NUMBERS >= 3
	EP_BUFS(3)
#endif
#if NUM_ENDPOINT_NUMBERS >= 4
	EP_BUFS(4)
#endif
#if NUM_ENDPOINT_NUMBERS >= 5
	EP_BUFS(5)
#endif
#if NUM_ENDPOINT_NUMBERS >= 6
	EP_BUFS(6)
#endif
#if NUM_ENDPOINT_NUMBERS >= 7
	EP_BUFS(7)
#endif
#if NUM_ENDPOINT_NUMBERS >= 8
	EP_BUFS(8)
#endif
#if NUM_ENDPOINT_NUMBERS >= 9
	EP_BUFS(9)
#endif
#if NUM_ENDPOINT_NUMBERS >= 10
	EP_BUFS(10)
#endif
#if NUM_ENDPOINT_NUMBERS >= 11
	EP_BUFS(11)
#endif
#if NUM_ENDPOINT_NUMBERS >= 12
	EP_BUFS(12)
#endif
#if NUM_ENDPOINT_NUMBERS >= 13
	EP_BUFS(13)
#endif
#if NUM_ENDPOINT_NUMBERS >= 14
	EP_BUFS(14)
#endif
#if NUM_ENDPOINT_NUMBERS >= 15
	EP_BUFS(15)
#endif

};
#undef EP_BUFS
#undef EP_BUFS0

/* Global data */
static bool addr_pending;
static uint8_t addr;
static uint8_t g_configuration;
static bool control_need_zlp;
static bool returning_short;

/* Data associated with multi-packet control transfers */
static usb_ep0_data_stage_callback ep0_data_stage_callback;
static char   *ep0_data_stage_in_buffer; /* XC8 v1.12 fails if this is const on PIC16 */
static char   *ep0_data_stage_out_buffer;
static size_t  ep0_data_stage_buf_remaining;
static void   *ep0_data_stage_context;
static uint8_t ep0_data_stage_direc; /*1=IN, 0=OUT, Same as USB spec.*/

#ifdef _PIC14E
/* Convert a pointer, which can be a normal banked pointer or a linear
 * pointer, to a linear pointer.
 *
 * The USB buffer descriptors need linear addresses. The XC8 compiler will
 * generate banked (not linear) addresses for the arrays in ep_buffers if
 * ep_buffers can fit within a single bank. This is good for code size, but
 * the buffer descriptors cannot take banked addresses, so they must be
 * generated from the banked addresses.
 *
 * See section 3.6.2 of the PIC16F1459 datasheet for details.
 */
static uint16_t pic16_linear_addr(void *ptr)
{
	uint8_t high, low;
	uint16_t addr = (uint16_t) ptr;

