JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
	/* Addresses over 0x2000 are already linear addresses. */
	if (addr >= 0x2000)
		return addr;

	high = (addr & 0xff00) >> 8;
	low  = addr & 0x00ff;

	return 0x2000 +
	       (low & 0x7f) - 0x20 +
	       ((high << 1) + (low & 0x80)? 1: 0) * 0x50;
}
#endif

static void reset_ep0_data_stage()
{
	ep0_data_stage_in_buffer = NULL;
	ep0_data_stage_out_buffer = NULL;
	ep0_data_stage_buf_remaining = 0;
	ep0_data_stage_callback = NULL;

	/* There's no need to reset the following because no decisions are
	   made based on them:
	     ep0_data_stage_context,
	     ep0_data_stage_direc
	 */
}

/* Initialize or reset all of the endpoints. This is done:
 *   1. at startup,
 *   2. following a USB reset, and
 *   3. whenever a SET_CONFIGURATION transfer is received. */
static void init_endpoints(void)
{
	uint8_t i;

	/* Hold ping-pong in reset for the whole time the endpoints
	   are being configured */
	SFR_USB_PING_PONG_RESET = 1;
	/* Reset the flags */
	ep0_buf.flags = 0;
	for (i = 0; i <= NUM_ENDPOINT_NUMBERS; i++) {
#ifdef PPB_EPn
		ep_buf[i].flags = 0;
#else
		ep_buf[i].flags = EP_RX_DTS;
#endif
	}

	/* Clear all the buffer-descriptors and re-initialize */
	memset(bds, 0x0, sizeof(bds));

	/* Setup endpoint 0 Output buffer descriptor.
	   Input and output are from the HOST perspective. */
	BDS0OUT(0).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep0_buf.out);
	SET_BDN(BDS0OUT(0), BDNSTAT_UOWN, EP_0_LEN);

#ifdef PPB_EP0_OUT
	BDS0OUT(1).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep0_buf.out1);
	SET_BDN(BDS0OUT(1), BDNSTAT_UOWN, EP_0_LEN);
#endif

	/* Setup endpoint 0 Input buffer descriptor.
	   Input and output are from the HOST perspective. */
	BDS0IN(0).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep0_buf.in);
	SET_BDN(BDS0IN(0), 0, EP_0_LEN);
#ifdef PPB_EP0_IN
	BDS0IN(1).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep0_buf.in1);
	SET_BDN(BDS0IN(1), 0, EP_0_LEN);
#endif

	for (i = 1; i <= NUM_ENDPOINT_NUMBERS; i++) {
		/* Setup endpoint 1 Output buffer descriptor.
		   Input and output are from the HOST perspective. */
		BDSnOUT(i,0).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep_buf[i].out);
		SET_BDN(BDSnOUT(i,0), BDNSTAT_UOWN|BDNSTAT_DTSEN, ep_buf[i].out_len);
#ifdef PPB_EPn
		/* Initialize EVEN buffers when in ping-pong mode. */
		BDSnOUT(i,1).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep_buf[i].out1);
		SET_BDN(BDSnOUT(i,1), BDNSTAT_UOWN|BDNSTAT_DTSEN|BDNSTAT_DTS, ep_buf[i].out_len);
#endif
		/* Setup endpoint 1 Input buffer descriptor.
		   Input and output are from the HOST perspective. */
		BDSnIN(i,0).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep_buf[i].in);
		SET_BDN(BDSnIN(i,0), 0, ep_buf[i].in_len);
#ifdef PPB_EPn
		/* Initialize EVEN buffers when in ping-pong mode. */
		BDSnIN(i,1).BDnADR = (BDNADR_TYPE) PHYS_ADDR(ep_buf[i].in1);
		SET_BDN(BDSnIN(i,1), 0, ep_buf[i].in_len);
#endif
	}

	SFR_USB_PING_PONG_RESET = 0;
}

/* usb_init() is called at powerup time, and when the device gets
   the reset signal from the USB bus (D+ and D- both held low) indicated
   by interrput bit URSTIF. */
void usb_init(void)
{
	uint8_t i;

	/* Initialize the USB. 18.4 of PIC24FJ64GB004 datasheet */
#ifndef USB_FULL_PING_PONG_ONLY
	SET_PING_PONG_MODE(PPB_MODE);
#endif
#if PPB_MODE != PPB_NONE
	SFR_USB_PING_PONG_RESET = 1;
	SFR_USB_PING_PONG_RESET = 0;
#endif
	SFR_USB_INTERRUPT_EN = 0x0;
	SFR_USB_EXTENDED_INTERRUPT_EN = 0x0;
	
	SFR_USB_EN = 1; /* enable USB module */

#ifdef USE_OTG
	SFR_OTGEN = 1;
#endif

	
#ifdef NEEDS_PULL
	SFR_PULL_EN = 1;  /* pull-up enable */
#endif

#ifdef HAS_ON_CHIP_XCVR_DIS
	SFR_ON_CHIP_XCVR_DIS = 0; /* on-chip transceiver Disable */
#endif

#ifdef HAS_LOW_SPEED
	SFR_FULL_SPEED_EN = 1;   /* Full-speed enable */
#endif

	CLEAR_USB_TOKEN_IF();   /* Clear 4 times to clear out USTAT FIFO */
	CLEAR_USB_TOKEN_IF();
	CLEAR_USB_TOKEN_IF();
	CLEAR_USB_TOKEN_IF();

	CLEAR_ALL_USB_IF();

#ifdef USB_USE_INTERRUPTS
	SFR_TRANSFER_IE = 1; /* USB Transfer Interrupt Enable */
	SFR_STALL_IE = 1;    /* USB Stall Interrupt Enable */
	SFR_RESET_IE = 1;    /* USB Reset Interrupt Enable */
#ifdef START_OF_FRAME_CALLBACK
	SFR_SOF_IE = 1;      /* USB Start-Of-Frame Interrupt Enable */
#endif
#endif

#ifdef USB_NEEDS_SET_BD_ADDR_REG
#ifdef __XC16__
	union WORD {
		struct {
			uint8_t lb;
			uint8_t hb;
		};
		uint16_t w;
		void *ptr;
	};
	union WORD w;
	w.ptr = bds;

	SFR_BD_ADDR_REG = w.hb;

#elif __XC32__
	union WORD {
		struct {
			uint8_t lb;
			uint8_t hb;
			uint8_t ub;
			uint8_t eb;
		};
		uint32_t w;
		void *ptr;
	};
	union WORD w;
	w.w = KVA_TO_PA(bds);

	SFR_BD_ADDR_REG1 = w.hb & 0xFE;
	SFR_BD_ADDR_REG2 = w.ub;
	SFR_BD_ADDR_REG3 = w.eb;
#endif
#endif

	/* These are the UEP/U1EP endpoint management registers. */
	
	/* Clear them all out. This is important because a bootloader
	   could have set them to non-zero */
	memset(SFR_EP_MGMT(0), 0x0, sizeof(*SFR_EP_MGMT(0)) * 16);
	
	/* Set up Endpoint zero */
	SFR_EP_MGMT(0)->SFR_EP_MGMT_HANDSHAKE = 1; /* Endpoint handshaking enable */
	SFR_EP_MGMT(0)->SFR_EP_MGMT_CON_DIS = 0; /* 1=Disable control operations */
	SFR_EP_MGMT(0)->SFR_EP_MGMT_OUT_EN = 1; /* Endpoint Out Transaction Enable */
	SFR_EP_MGMT(0)->SFR_EP_MGMT_IN_EN = 1; /* Endpoint In Transaction Enable */
	SFR_EP_MGMT(0)->SFR_EP_MGMT_STALL = 0; /* Stall */

	for (i = 1; i <= NUM_ENDPOINT_NUMBERS; i++) {
		volatile SFR_EP_MGMT_TYPE *ep = SFR_EP_MGMT(i);
		ep->SFR_EP_MGMT_HANDSHAKE = 1; /* Endpoint handshaking enable */
		ep->SFR_EP_MGMT_CON_DIS = 1; /* 1=Disable control operations */
		ep->SFR_EP_MGMT_OUT_EN = 1; /* Endpoint Out Transaction Enable */
		ep->SFR_EP_MGMT_IN_EN = 1; /* Endpoint In Transaction Enable */
		ep->SFR_EP_MGMT_STALL = 0; /* Stall */
	}

	/* Reset the Address. */
	SFR_USB_ADDR = 0x0;
	addr_pending = 0;
	g_configuration = 0;

	init_endpoints();

	#ifdef USB_NEEDS_POWER_ON
	SFR_USB_POWER = 1;
	#endif

#ifdef USE_OTG
	SFR_DPPULUP = 1;
#endif

	reset_ep0_data_stage();

#ifdef USB_USE_INTERRUPTS
	SFR_USB_IE = 1;     /* USB Interrupt enable */
#endif
	
	//UIRbits.URSTIF = 0; /* Clear USB Reset on Start */
}

static void reset_bd0_out(void)
{
	/* Clean up the Buffer Descriptors.
	 * Set the length and hand it back to the SIE.
	 * The Address stays the same. */
#ifdef PPB_EP0_OUT
	SET_BDN(BDS0OUT(SFR_USB_STATUS_PPBI), BDNSTAT_UOWN, EP_0_LEN);
#else
	SET_BDN(BDS0OUT(0), BDNSTAT_UOWN, EP_0_LEN);
#endif
}

static void stall_ep0(void)
{
	/* Stall Endpoint 0. It's important that DTSEN and DTS are zero. */
#ifdef PPB_EP0_IN
	uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
	SET_BDN(BDS0IN(ppbi), BDNSTAT_UOWN|BDNSTAT_BSTALL, EP_0_LEN);
	/* The PPBI does not advance for STALL. */
#else
	SET_BDN(BDS0IN(0), BDNSTAT_UOWN|BDNSTAT_BSTALL, EP_0_LEN);
#endif
}

#ifdef NEEDS_CLEAR_STALL
static void clear_ep0_stall(void)
{
	/* Clear Endpoint 0 Stall and UOWN. This is supposed to be done by
	 * the hardware, but it isn't on PIC16 and PIC18. */
#ifdef PPB_EP0_IN
	uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
	SET_BDN(BDS0IN(ppbi), 0, EP_0_LEN);
	/* The PPBI does not advance for STALL. */
#else
	SET_BDN(BDS0IN(0), 0, EP_0_LEN);
#endif
}
#endif

static void stall_ep_in(uint8_t ep)
{
	/* Stall Endpoint. It's important that DTSEN and DTS are zero.
	 * Although the datasheet doesn't stay it, the only safe way to do this
	 * is to set BSTALL on BOTH buffers when in ping-pong mode. */
	SET_BDN(BDSnIN(ep, 0), BDNSTAT_UOWN|BDNSTAT_BSTALL, ep_buf[ep].in_len);
#ifdef PPB_EPn
	SET_BDN(BDSnIN(ep, 1), BDNSTAT_UOWN|BDNSTAT_BSTALL, ep_buf[ep].in_len);
#endif
    uart_transmit("Endpoint IN stall", 1);
}

static void stall_ep_out(uint8_t ep)
{
	/* Stall Endpoint. It's important that DTSEN and DTS are zero.
	 * Although the datasheet doesn't stay it, the only safe way to do this
	 * is to set BSTALL on BOTH buffers when in ping-pong mode. */
	SET_BDN(BDSnOUT(ep, 0), BDNSTAT_UOWN|BDNSTAT_BSTALL , 0);
#ifdef PPB_EPn
	SET_BDN(BDSnOUT(ep, 1), BDNSTAT_UOWN|BDNSTAT_BSTALL , 0);
#endif
}

