JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
static void send_zero_length_packet_ep0()
{
#ifdef PPB_EP0_IN
	uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
	BDS0IN(ppbi).STAT.BDnSTAT = 0;
	SET_BDN(BDS0IN(ppbi), BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, 0);
	ep0_buf.flags ^= EP_TX_PPBI;
#else
	BDS0IN(0).STAT.BDnSTAT = 0;
	SET_BDN(BDS0IN(0), BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, 0);
#endif
}

static void usb_send_in_buffer_0(size_t len)
{
	if (!usb_in_endpoint_halted(0)) {
#ifdef PPB_EP0_IN
		struct buffer_descriptor *bd;
		uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
		uint8_t pid = (ep0_buf.flags & EP_TX_DTS)? 1 : 0;
		bd = &BDS0IN(ppbi);
		bd->STAT.BDnSTAT = 0;

		if (pid)
			SET_BDN(*bd,
				BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, len);
		else
			SET_BDN(*bd,
				BDNSTAT_UOWN|BDNSTAT_DTSEN, len);

		ep0_buf.flags ^= EP_TX_PPBI;
		ep0_buf.flags ^= EP_TX_DTS;
#else
		uint8_t pid;
		pid = (ep0_buf.flags & EP_TX_DTS)? 1 : 0;
		BDS0IN(0).STAT.BDnSTAT = 0;

		if (pid)
			SET_BDN(BDS0IN(0),
				BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, len);
		else
			SET_BDN(BDS0IN(0),
				BDNSTAT_UOWN|BDNSTAT_DTSEN, len);

		ep0_buf.flags ^= EP_TX_DTS;
#endif
	}
}

/* Copy Data to Endpoint 0's IN Buffer
 *
 * Copy len bytes from ptr into endpoint 0's current IN
 * buffer, taking into account the ping-pong state.
 */
#ifdef PPB_EP0_IN
static void copy_to_ep0_in_buf(const void *ptr, size_t len)
{
	uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
	if (ppbi)
		memcpy_from_rom(ep0_buf.in1, ptr, len);
	else
		memcpy_from_rom(ep0_buf.in, ptr, len);
}
#else
	#define copy_to_ep0_in_buf(PTR, LEN) memcpy_from_rom(ep0_buf.in, PTR, LEN);
#endif

/* Start Control Return
 *
 * Start the data stage of an IN control transfer. This is primarily used
 * for sending descriptors and other chapter 9 data back to the host, but it
 * is also called from usb_send_data_stage() for handling control transfers
 * handled by the application.
 *
 * This function sets up the global state variables necessary to do a
 * multi-transaction IN data stage and sends the first transaction.
 *
 * Params:
 *   ptr             - a pointer to the data to send
 *   len             - the size of the data which can be sent (ie: the size
 *                     of the entire descriptor)
 *   bytes_asked_for - the number of bytes asked for by the host in
 *                     the SETUP phase
 */
static void start_control_return(const void *ptr, size_t len, size_t bytes_asked_for)
{
	uint8_t bytes_to_send = MIN(len, EP_0_IN_LEN);
	bytes_to_send = MIN(bytes_to_send, bytes_asked_for);
	returning_short = len < bytes_asked_for;
	if (bytes_to_send > 0)
		copy_to_ep0_in_buf(ptr, bytes_to_send);
	ep0_data_stage_in_buffer = ((char*)ptr) + bytes_to_send;
	ep0_data_stage_buf_remaining = MIN(bytes_asked_for, len) - bytes_to_send;

	/* Send back the first transaction */
	ep0_buf.flags |= EP_TX_DTS;
	usb_send_in_buffer_0(bytes_to_send);
}

static inline int8_t handle_standard_control_request()
{
	FAR struct setup_packet *setup;
	int8_t res = 0;

#ifdef PPB_EP0_OUT
	if (SFR_USB_STATUS_PPBI)
		setup = (struct setup_packet*) ep0_buf.out1;
	else
		setup = (struct setup_packet*) ep0_buf.out;
#else
	setup = (struct setup_packet*) ep0_buf.out;
#endif

	if (setup->bRequest == GET_DESCRIPTOR &&
	    setup->REQUEST.bmRequestType == 0x80 /* Section 9.4, Table 9-3 */) {
		char descriptor = ((setup->wValue >> 8) & 0x00ff);
		uint8_t descriptor_index = setup->wValue & 0x00ff;

		if (descriptor == DESC_DEVICE) {
			uart_transmit("Get Descriptor for DEVICE", 1);

			/* Return Device Descriptor */
			start_control_return(&USB_DEVICE_DESCRIPTOR, USB_DEVICE_DESCRIPTOR.bLength, setup->wLength);
		}
		else if (descriptor == DESC_CONFIGURATION) {
			const struct configuration_descriptor *desc;
			if (descriptor_index >= NUMBER_OF_CONFIGURATIONS)
				stall_ep0();
			else {
				desc = USB_CONFIG_DESCRIPTOR_MAP[descriptor_index];
				start_control_return(desc, desc->wTotalLength, setup->wLength);
			}
		}
		else if (descriptor == DESC_STRING) {
#ifdef MICROSOFT_OS_DESC_VENDOR_CODE
			if (descriptor_index == 0xee) {
				/* Microsoft descriptor Requested */
				#ifdef __XC8
				/* static is better in all cases on XC8. On
				 * XC16/32, non-static uses less RAM. */
				static
				#endif
				struct microsoft_os_descriptor os_descriptor =
				{
					0x12,                          /* bLength */
					0x3,                           /* bDescriptorType */
					{'M','S','F','T','1','0','0'}, /* qwSignature */
					MICROSOFT_OS_DESC_VENDOR_CODE, /* bMS_VendorCode */
					0x0,                           /* bPad */
				};

				start_control_return(&os_descriptor, sizeof(os_descriptor), setup->wLength);
			}
			else
#endif
			{
#ifdef USB_STRING_DESCRIPTOR_FUNC
				const void *desc;
				int16_t len;
				{
					len = USB_STRING_DESCRIPTOR_FUNC(descriptor_index, &desc);
					if (len < 0) {
						stall_ep0();
						uart_transmit("Unsupported string descriptor requested", 1);
					}
					else
						start_control_return(desc, len, setup->wLength);
				}
#else
				/* Strings are not supported on this device. */
				stall_ep0();
#endif
			}
		}
		else {
#ifdef UNKNOWN_GET_DESCRIPTOR_CALLBACK
			int16_t len;
			const void *desc;
			len = UNKNOWN_GET_DESCRIPTOR_CALLBACK(setup, &desc);
			if (len < 0) {
				stall_ep0();
				uart_transmit("Unsupported descriptor requested", 1);
			}
			else
				start_control_return(desc, len, setup->wLength);
#else
			/* Unknown Descriptor. Stall the endpoint. */
			stall_ep0();
			uart_transmit("Unknown Descriptor", 1);
			uart_transmit_val(descriptor, 4, 1);
#endif
		}
	}
	else if (setup->bRequest == SET_ADDRESS) {
		/* Mark the ADDR as pending. The address gets set only
		   after the transaction is complete. */
		addr_pending = 1;
		addr = setup->wValue;

		send_zero_length_packet_ep0();
	}
	else if (setup->bRequest == SET_CONFIGURATION) {
		/* Set the configuration. wValue is the configuration.
		 * A value of 0 means to un-set the configuration and
		 * go back to the ADDRESS state. */
		uint8_t req = setup->wValue & 0x00ff;
#ifdef SET_CONFIGURATION_CALLBACK
		SET_CONFIGURATION_CALLBACK(req);
#endif
		/* Re-initialize the endpoints. USB 2.0 section 9.1.1.5
		 * requires that all endpoint data toggles be reset to DATA0
		 * when SET_CONFIGURATION is received. With ping-ponging
		 * involved, the only way to properly reset the data toggles
		 * is to reset all the endpoints. */
		init_endpoints();

		send_zero_length_packet_ep0();
		g_configuration = req;

		uart_transmit("Set configuration to ", 0);
		uart_transmit_val(req, 4, 1);
	}
	else if (setup->bRequest == GET_CONFIGURATION) {
		/* Return the current Configuration. */
		uart_transmit("Get Configuration. Returning: ", 0);
		uart_transmit_val(g_configuration, 4, 1);

		start_control_return(&g_configuration, 1, setup->wLength);
	}
	else if (setup->bRequest == GET_STATUS) {

