JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
		uart_transmit("Get Status (dst, index): ", 1);
		uart_transmit_val(setup->REQUEST.destination, 4, 1);
		uart_transmit_val(setup->wIndex, 4, 1);

		if (setup->REQUEST.destination == 0 /*0=device*/) {
			/* Status for the DEVICE requested
			   Return as a single byte in the return packet. */
			uint16_t ret;
#ifdef GET_DEVICE_STATUS_CALLBACK
			ret = GET_DEVICE_STATUS_CALLBACK();
#else
			ret = 0x0000;
#endif
			start_control_return(&ret, 2, setup->wLength);
		}
		else if (setup->REQUEST.destination == 2 /*2=endpoint*/) {
			/* Status of endpoint */
			uint8_t ep_num = setup->wIndex & 0x0f;
			if (ep_num <= NUM_ENDPOINT_NUMBERS) {
				uint8_t flags = ep_buf[ep_num].flags;
				uint8_t ret[2];
				ret[0] = ((setup->wIndex & 0x80) ?
					flags & EP_IN_HALT_FLAG :
					flags & EP_OUT_HALT_FLAG) != 0;
				ret[1] = 0;
				start_control_return(ret, 2, setup->wLength);
			}
			else {
				/* Endpoint doesn't exist. STALL. */
				stall_ep0();
			}
		}
		else {
			stall_ep0();
			uart_transmit("Stalling. Status Requested for destination: ", 0);
			uart_transmit_val(setup->REQUEST.destination, 4, 1);
		}

	}
	else if (setup->bRequest == SET_INTERFACE) {
		/* Set the alternate setting for an interface.
		 * wIndex is the interface.
		 * wValue is the alternate setting. */
#ifdef SET_INTERFACE_CALLBACK
		int8_t res;
		res = SET_INTERFACE_CALLBACK(setup->wIndex, setup->wValue);
		if (res < 0) {
			stall_ep0();
		}
		else
			send_zero_length_packet_ep0();
#else
		/* If there's no callback, then assume that
		 * we only have one alternate setting per
		 * interface. */
		send_zero_length_packet_ep0();
#endif
	}
	else if (setup->bRequest == GET_INTERFACE) {
		int8_t ret;
		uart_transmit("Get Interface", 1);
		uart_transmit_val(setup->bRequest, 4, 1);
		uart_transmit_val(setup->REQUEST.destination, 4, 1);
		uart_transmit_val(setup->REQUEST.type, 4, 1);
		uart_transmit_val(setup->REQUEST.direction, 4, 1);
#ifdef GET_INTERFACE_CALLBACK
		ret = GET_INTERFACE_CALLBACK(setup->wIndex);
		if (ret < 0)
			stall_ep0();
		else {
			/* Return the current alternate setting
			   as a single byte in the return packet. */
			start_control_return(&ret, 1, setup->wLength);
		}
#else
		/* If there's no callback, then assume that
		 * we only have one alternate setting per
		 * interface and return zero as that
		 * alternate setting. */
		ret = 0;
		start_control_return(&ret, 1, setup->wLength);
#endif
	}
	else if (setup->bRequest == CLEAR_FEATURE || setup->bRequest == SET_FEATURE) {
		uint8_t stall = 1;
		if (setup->REQUEST.destination == 0/*0=device*/) {
			uart_transmit("Set/Clear feature for device", 1);
			/* TODO Remote Wakeup flag */
		}

		if (setup->REQUEST.destination == 2/*2=endpoint*/) {
			if (setup->wValue == 0/*0=ENDPOINT_HALT*/) {
				uint8_t ep_num = setup->wIndex & 0x0f;
				uint8_t ep_dir = setup->wIndex & 0x80;
				if (ep_num <= NUM_ENDPOINT_NUMBERS) {
					if (setup->bRequest == SET_FEATURE) {
						/* Set Endpoint Halt Feature.
						   Stall the affected endpoint. */
						if (ep_dir) {
							usb_halt_ep_in(ep_num);
						}
						else {
							usb_halt_ep_out(ep_num);
						}
					}
					else {
						/* Clear Endpoint Halt Feature.
						   Clear the STALL on the affected endpoint. */
						if (ep_dir) {
#ifdef PPB_EPn
							SET_BDN(BDSnIN(ep_num, 0), 0, ep_buf[ep_num].in_len);
							SET_BDN(BDSnIN(ep_num, 1), 0, ep_buf[ep_num].in_len);
#else
							SET_BDN(BDSnIN(ep_num, 0), 0, ep_buf[ep_num].in_len);
#endif
							/* Clear DTS. Next packet to be sent will be DATA0. */
							ep_buf[ep_num].flags &= ~EP_TX_DTS;

							ep_buf[ep_num].flags &= ~(EP_IN_HALT_FLAG);
						}
						else {
#ifdef PPB_EPn
							uint8_t ppbi = (ep_buf[ep_num].flags & EP_RX_PPBI)? 1 : 0;
							/* Put the current buffer at DTS 0, and the next (opposite) buffer at DTS 1 */
							SET_BDN(BDSnOUT(ep_num, ppbi), BDNSTAT_UOWN|BDNSTAT_DTSEN, ep_buf[ep_num].out_len);
							SET_BDN(BDSnOUT(ep_num, !ppbi), BDNSTAT_UOWN|BDNSTAT_DTSEN|BDNSTAT_DTS, ep_buf[ep_num].out_len);

							/* Clear DTS */
							ep_buf[ep_num].flags &= ~EP_RX_DTS;
#else
							SET_BDN(BDSnOUT(ep_num, 0), BDNSTAT_UOWN|BDNSTAT_DTSEN, ep_buf[ep_num].out_len);

							/* Set DTS */
							ep_buf[ep_num].flags |= EP_RX_DTS;
#endif
							ep_buf[ep_num].flags &= ~(EP_OUT_HALT_FLAG);
						}
					}
#ifdef ENDPOINT_HALT_CALLBACK
					ENDPOINT_HALT_CALLBACK(setup->wIndex, (setup->bRequest == SET_FEATURE));
#endif
					stall = 0;
				}
			}
		}

		if (!stall) {
			send_zero_length_packet_ep0();
		}
		else
			stall_ep0();
	}
	else {
		res = -1;

		uart_transmit("unsupported request (req, dest, type, dir) ", 1);
		uart_transmit_val(setup->bRequest, 4, 1);
		uart_transmit_val(setup->REQUEST.destination, 4, 1);
		uart_transmit_val(setup->REQUEST.type, 4, 1);
		uart_transmit_val(setup->REQUEST.direction, 4, 1);
	}

	return res;
}

static inline void handle_ep0_setup()
{
	FAR struct setup_packet *setup;
#ifdef PPB_EP0_OUT
	if (SFR_USB_STATUS_PPBI)
		setup = (struct setup_packet*) ep0_buf.out1;
	else
		setup = (struct setup_packet*) ep0_buf.out;
#else
	setup = (struct setup_packet*) ep0_buf.out;
#endif

	ep0_data_stage_direc = setup->REQUEST.direction;
	int8_t res;

#ifdef NEEDS_CLEAR_STALL
	/* The datasheets say the MCU will clear BSTALL and UOWN when
	 * a SETUP packet is received. This does not seem to happen on
	 * PIC16 or PIC18, so clear the stall explicitly. */
	clear_ep0_stall();
#endif

	/* Receiving a Setup packet cancels any control transfer which was
	 * in progress and thus invalidates any IN transactions which were
	 * pending for a previous control transfer. Cancel any of these IN
	 * transactions which were pending. */
#ifdef PPB_EP0_OUT
	/* For ping-pong mode on EP 0, note below that ppbi is the next
	 * ping-pong buffer which would be written to, meaning that !ppbi is
	 * the buffer which would have an IN transaction pending (if any).
	 *
	 * Only one ping-pong buffer is cleared (instead of both) because
	 * M-Stack only puts one transfer at a time on the control IN endpoint.
	 */
	uint8_t ppbi = (ep0_buf.flags & EP_TX_PPBI)? 1: 0;
	if (BDS0IN(!ppbi).STAT.UOWN) {
		SET_BDN(BDS0IN(!ppbi), 0, EP_0_LEN);
		ep0_buf.flags ^= EP_TX_PPBI;
	}
#else
	if (BDS0IN(0).STAT.UOWN) {
		SET_BDN(BDS0IN(0), 0, EP_0_LEN);
	}
#endif

