JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
	if (ep0_data_stage_buf_remaining) {
		/* A SETUP transaction has been received while waiting
		 * for a DATA stage to complete; something is broken.
		 * If this was an application-controlled transfer (and
		 * there's a callback), notify the application of this. */
		if (ep0_data_stage_callback)
			ep0_data_stage_callback(0/*fail*/, ep0_data_stage_context);

		reset_ep0_data_stage();
	}

	if (setup->REQUEST.type == REQUEST_TYPE_STANDARD) {
		res = handle_standard_control_request();
		if (res < 0)
			goto handle_unknown;
	}
#ifdef MICROSOFT_OS_DESC_VENDOR_CODE
	else if (setup->bRequest == MICROSOFT_OS_DESC_VENDOR_CODE) {
		const void *desc;
		int16_t len = -1;

		if (setup->REQUEST.bmRequestType == 0xC0 &&
		    setup->wIndex == 0x0004) {
			len = MICROSOFT_COMPAT_ID_DESCRIPTOR_FUNC(
				setup->wValue,
				&desc);
		}
		else if (setup->REQUEST.bmRequestType == 0xC1 &&
		         setup->wIndex == 0x0005) {
			len = MICROSOFT_CUSTOM_PROPERTY_DESCRIPTOR_FUNC(
				setup->wValue,
				&desc);
		}

		if (len < 0)
			stall_ep0();
		else
			start_control_return(desc, len, setup->wLength);
	}
#endif
	else
		goto handle_unknown;

	goto out;

handle_unknown:

#ifdef UNKNOWN_SETUP_REQUEST_CALLBACK
	res = UNKNOWN_SETUP_REQUEST_CALLBACK(setup);
	if (res < 0)
		stall_ep0();
	else {
		/* If the application has handled this request, it
		 * will have already set up whatever needs to be set
		 * up for the data stage. */
	}
#else
	/* Unsupported Request. Stall the Endpoint. */
	stall_ep0();
#endif

out:
	/* SETUP packet sets PKTDIS which disables
	 * future SETUP packet reception. Turn it off
	 * afer we've processed the current SETUP
	 * packet to avoid a race condition. */
	SFR_USB_PKT_DIS = 0;
}

static inline void handle_ep0_out()
{
#ifdef PPB_EP0_OUT
	uint8_t pkt_len = BDN_LENGTH(BDS0OUT(SFR_USB_STATUS_PPBI));
#else
	uint8_t pkt_len = BDN_LENGTH(BDS0OUT(0));
#endif
	if (ep0_data_stage_direc == 1/*1=IN*/) {
		/* An empty OUT packet on an IN control transfer
		 * means the STATUS stage of the control
		 * transfer has completed (possibly early). */
        //uart_transmit("Control transfer status complete (EP0 OUT handle)". 1);

		/* Notify the application (if applicable) */
		if (ep0_data_stage_callback)
			ep0_data_stage_callback(1/*true*/, ep0_data_stage_context);
		reset_ep0_data_stage();
	}
	else {
		/* A packet received as part of the data stage of
		 * a control transfer. Pack what data we received
		 * into the application's buffer (if it has
		 * provided one). When all the data has been
		 * received, call the application-provided callback.
		 */
        //uart_transmit("Control transfer data received", 1);

		if (ep0_data_stage_out_buffer) {
            //uart_transmit("Control transfer data received", 1);
            //uart_transmit("Buf: ", 0);
            //uart_transmit_val(ep0_data_stage_out_buffer, 4, 1);
            //uart_transmit("Remaining data len: ", 0);
            //uart_transmit_val(ep0_data_stage_buf_remaining, 4, 1);
			uint8_t bytes_to_copy = MIN(pkt_len, ep0_data_stage_buf_remaining);
#ifdef PPB_EP0_OUT
			if (SFR_USB_STATUS_PPBI)
				memcpy(ep0_data_stage_out_buffer, ep0_buf.out1, bytes_to_copy);
			else
				memcpy(ep0_data_stage_out_buffer, ep0_buf.out, bytes_to_copy);
            //uart_transmit("OUT data: ", 0);
            //uart_hexdump(ep0_data_stage_out_buffer, pkt_len);
#else
			memcpy(ep0_data_stage_out_buffer, ep0_buf.out, bytes_to_copy);
#endif
			ep0_data_stage_out_buffer += bytes_to_copy;
			ep0_data_stage_buf_remaining -= bytes_to_copy;

			/* It's possible that bytes_to_copy is less than pkt_len
			 * here because the application provided too small a buffer. */

			if (pkt_len < EP_0_OUT_LEN || ep0_data_stage_buf_remaining == 0) {
				/* Short packet or we've received the expected length.
				 * All data has been transferred (or all the data
				 * has been received which can be received). */

				if (bytes_to_copy < pkt_len) {
					/* The buffer provided by the application was too short */
					stall_ep0();
					if (ep0_data_stage_callback)
						ep0_data_stage_callback(0/*false*/, ep0_data_stage_context);
					reset_ep0_data_stage();
				}
				else {
					/* The data stage has completed. Notify the application
					 * and set up the status stage accordingly as success
					 * (zero-length packet) or failure (STALL). */
					int8_t res = 0;

					if (ep0_data_stage_callback)
						res = ep0_data_stage_callback(1/*true*/, ep0_data_stage_context);

					if (res < 0) {
						/* The application has indicated failure of
						 * some kind, so stall the transfer */
						stall_ep0();
					}
					else {
						/* Set up the successful status
						 * stage. */
						send_zero_length_packet_ep0();
					}

					/* Remove the callback pointer so it
					 * is not called again at the end of
					 * the status stage */
					ep0_data_stage_callback = NULL;
				}
			}
		}
	}
}

static inline void handle_ep0_in()
{
	if (addr_pending) {
		SFR_USB_ADDR =  addr;
		addr_pending = 0;
	}

	if (ep0_data_stage_buf_remaining) {
		/* There's already a multi-transaction transfer in process. */
		uint8_t bytes_to_send = MIN(ep0_data_stage_buf_remaining, EP_0_IN_LEN);
        //uart_transmit("IN data: ", 0);
        //uart_hexdump(ep0_data_stage_in_buffer, bytes_to_send);
		copy_to_ep0_in_buf(ep0_data_stage_in_buffer, bytes_to_send);
		ep0_data_stage_buf_remaining -= bytes_to_send;
		ep0_data_stage_in_buffer += bytes_to_send;

		/* If we hit the end with a full-length packet, set up
		   to send a zero-length packet at the next IN token, but only
		   if we are returning less data than was requested. */
		if (ep0_data_stage_buf_remaining == 0 &&
		    bytes_to_send == EP_0_IN_LEN &&
		    returning_short)
			control_need_zlp = 1;

		usb_send_in_buffer_0(bytes_to_send);
	}
	else if (control_need_zlp) {
		usb_send_in_buffer_0(0);
		control_need_zlp = 0;
		reset_ep0_data_stage();
	}
	else {
		if (ep0_data_stage_direc == 0/*OUT*/) {
			/* An IN on the control endpoint with no data pending
			 * and during an OUT transfer means the STATUS stage
			 * of the control transfer has completed. If there
			 * is still a callback, call it. */
            //uart_transmit("Control transfer status complete (EP0 IN handle)", 1);
			if (ep0_data_stage_callback)
				ep0_data_stage_callback(1/*true*/, ep0_data_stage_context);
			reset_ep0_data_stage();
		}
	}
}

