JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
/* checkUSB() is called repeatedly to check for USB interrupts
   and service USB requests */
void usb_service(void)
{
	if (SFR_USB_RESET_IF) {
		/* A Reset was detected on the wire. Re-init the SIE. */
#ifdef USB_RESET_CALLBACK
		USB_RESET_CALLBACK();
#endif
		usb_init();
		CLEAR_USB_RESET_IF();
		//uart_transmit("USB Reset", 1);
	}
	
	if (SFR_USB_STALL_IF) {
        //uart_transmit("USB Stall", 1);
		/* On PIC24/32, EPSTALL bits must be cleared, or else the
		 * stalled endpoint's opposite direction (eg: EP1 IN => EP1
		 * OUT) will also stall (incorrectly). There is no way to
		 * determine which endpoint generated this interrupt, so all
		 * the endpoints' EPSTALL bits must be checked and cleared. */
		int i;
		for (i = 1; i <= NUM_ENDPOINT_NUMBERS; i++) {
			volatile SFR_EP_MGMT_TYPE *ep = SFR_EP_MGMT(i);
			ep->SFR_EP_MGMT_STALL = 0;
		}

		CLEAR_USB_STALL_IF();
	}


#ifdef USB_USE_INTERRUPTS
	if (SFR_USB_TOKEN_IF && SFR_TRANSFER_IE) {
#else
	if (SFR_USB_TOKEN_IF) {
#endif

		//struct ustat_bits ustat = *((struct ustat_bits*)&USTAT);

		if (SFR_USB_STATUS_EP == 0 && SFR_USB_STATUS_DIR == 0/*OUT*/) {
            //uart_transmit("OUT transaction received", 1);
			/* An OUT or SETUP transaction has completed on
			 * Endpoint 0.  Handle the data that was received.
			 */
#ifdef PPB_EP0_OUT
			uint8_t pid = BDS0OUT(SFR_USB_STATUS_PPBI).STAT.PID;
#else
			uint8_t pid = BDS0OUT(0).STAT.PID;
#endif
			if (pid == PID_SETUP) {
				handle_ep0_setup();
			}
			else if (pid == PID_IN) {
				/* Nonsense condition:
				   (PID IN on SFR_USB_STATUS_DIR == OUT) */
			}
			else if (pid == PID_OUT) {
				handle_ep0_out();
			}
			else {
				/* Unsupported PID. Stall the Endpoint. */
				uart_transmit("Unsupported PID. Stall.", 1);
				stall_ep0();
			}

			reset_bd0_out();
		}
		else if (SFR_USB_STATUS_EP == 0 && SFR_USB_STATUS_DIR == 1/*1=IN*/) {
            //uart_transmit("IN transaction complete", 1);
			/* An IN transaction has completed. The endpoint
			 * needs to be re-loaded with the next transaction's
			 * data if there is any.
			 */
			handle_ep0_in();
		}
		else if (SFR_USB_STATUS_EP > 0 && SFR_USB_STATUS_EP <= NUM_ENDPOINT_NUMBERS) {
			if (SFR_USB_STATUS_DIR == 1 /*1=IN*/) {
				/* An IN transaction has completed. */
				//uart_transmit("IN transaction complete on non-EP0.", 1);
				if (ep_buf[SFR_USB_STATUS_EP].flags & EP_IN_HALT_FLAG)
					stall_ep_in(SFR_USB_STATUS_EP);
				else {
#ifdef IN_TRANSACTION_COMPLETE_CALLBACK
					IN_TRANSACTION_COMPLETE_CALLBACK(SFR_USB_STATUS_EP);
#endif
				}
			}
			else {
				/* An OUT transaction has completed. */
				//uart_transmit("OUT transaction received on non-EP0", 1);
				if (ep_buf[SFR_USB_STATUS_EP].flags & EP_OUT_HALT_FLAG)
					stall_ep_out(SFR_USB_STATUS_EP);
				else {
#ifdef OUT_TRANSACTION_CALLBACK
					OUT_TRANSACTION_CALLBACK(SFR_USB_STATUS_EP);
#endif
				}
			}
		}
		else {
			/* Transaction completed on an endpoint not used.
			 * This should never happen. */
			uart_transmit("Transaction completed for unknown endpoint", 1);
		}

		CLEAR_USB_TOKEN_IF();
	}
	
	/* Check for Start-of-Frame interrupt. */
	if (SFR_USB_SOF_IF) {
#ifdef START_OF_FRAME_CALLBACK
		START_OF_FRAME_CALLBACK();
#endif
        //uart_transmit("Start-of-frame interrupt", 1);
		CLEAR_USB_SOF_IF();
	}

	/* Check for USB Interrupt. */
	if (SFR_USB_IF) {
		SFR_USB_IF = 0;
	}
}

uint8_t usb_get_configuration(void)
{
	return g_configuration;
}

unsigned char *usb_get_in_buffer(uint8_t endpoint)
{
#ifdef PPB_EPn
	if (ep_buf[endpoint].flags & EP_TX_PPBI /*odd*/)
		return ep_buf[endpoint].in1;
	else
		return ep_buf[endpoint].in;
#else
	return ep_buf[endpoint].in;
#endif
}

void usb_send_in_buffer(uint8_t endpoint, size_t len)
{
#ifdef DEBUG
	if (endpoint == 0)
		error();
#endif
	if (g_configuration > 0 && !usb_in_endpoint_halted(endpoint)) {
		uint8_t pid;
		struct buffer_descriptor *bd;
#ifdef PPB_EPn
		uint8_t ppbi = (ep_buf[endpoint].flags & EP_TX_PPBI)? 1 : 0;

		bd = &BDSnIN(endpoint,ppbi);
		pid = (ep_buf[endpoint].flags & EP_TX_DTS)? 1 : 0;
		bd->STAT.BDnSTAT = 0;

		if (pid)
			SET_BDN(BDSnIN(endpoint,ppbi),
				BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, len);
		else
			SET_BDN(BDSnIN(endpoint,ppbi),
				BDNSTAT_UOWN|BDNSTAT_DTSEN, len);

		ep_buf[endpoint].flags ^= EP_TX_PPBI;
		ep_buf[endpoint].flags ^= EP_TX_DTS;
#else
		bd = &BDSnIN(endpoint,0);
		pid = (ep_buf[endpoint].flags & EP_TX_DTS)? 1 : 0;
		bd->STAT.BDnSTAT = 0;

		if (pid)
			SET_BDN(*bd,
				BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN, len);
		else
			SET_BDN(*bd,
				BDNSTAT_UOWN|BDNSTAT_DTSEN, len);

		ep_buf[endpoint].flags ^= EP_TX_DTS;
#endif
	}
}

bool usb_in_endpoint_busy(uint8_t endpoint)
{
#ifdef PPB_EPn
	uint8_t ppbi = (ep_buf[endpoint].flags & EP_TX_PPBI)? 1: 0;
	return BDSnIN(endpoint, ppbi).STAT.UOWN;
#else
	return BDSnIN(endpoint,0).STAT.UOWN;
#endif
}

uint8_t usb_halt_ep_in(uint8_t ep)
{
	if (ep == 0 || ep > NUM_ENDPOINT_NUMBERS)
		return -1;

	ep_buf[ep].flags |= EP_IN_HALT_FLAG;
	stall_ep_in(ep);

	return 0;
}

bool usb_in_endpoint_halted(uint8_t endpoint)
{
	return ep_buf[endpoint].flags & EP_IN_HALT_FLAG;
}

uint8_t usb_get_out_buffer(uint8_t endpoint, const unsigned char **buf)
{
#ifdef PPB_EPn
	uint8_t ppbi = (ep_buf[endpoint].flags & EP_RX_PPBI)? 1: 0;

	if (ppbi /*odd*/)
		*buf = ep_buf[endpoint].out1;
	else
		*buf = ep_buf[endpoint].out;

	return BDN_LENGTH(BDSnOUT(endpoint, ppbi));
#else
	*buf = ep_buf[endpoint].out;
	return BDN_LENGTH(BDSnOUT(endpoint, 0));
#endif
}

bool usb_out_endpoint_has_data(uint8_t endpoint)
{
#ifdef PPB_EPn
	uint8_t ppbi = (ep_buf[endpoint].flags & EP_RX_PPBI)? 1: 0;
	return !BDSnOUT(endpoint,ppbi).STAT.UOWN;
#else
	return !BDSnOUT(endpoint,0).STAT.UOWN;
#endif
}

void usb_arm_out_endpoint(uint8_t endpoint)
{
#ifdef PPB_EPn
	uint8_t ppbi = (ep_buf[endpoint].flags & EP_RX_PPBI)? 1: 0;
	uint8_t pid = (ep_buf[endpoint].flags & EP_RX_DTS)? 1: 0;

	if (pid)
		SET_BDN(BDSnOUT(endpoint,ppbi),
			BDNSTAT_UOWN|BDNSTAT_DTSEN|BDNSTAT_DTS,
			ep_buf[endpoint].out_len);
	else
		SET_BDN(BDSnOUT(endpoint,ppbi),
			BDNSTAT_UOWN|BDNSTAT_DTSEN,
			ep_buf[endpoint].out_len);

	/* Alternate the PPBI */
	ep_buf[endpoint].flags ^= EP_RX_PPBI;
	ep_buf[endpoint].flags ^= EP_RX_DTS;

#else
	uint8_t pid = (ep_buf[endpoint].flags & EP_RX_DTS)? 1: 0;
	if (pid)
		SET_BDN(BDSnOUT(endpoint,0),
			BDNSTAT_UOWN|BDNSTAT_DTS|BDNSTAT_DTSEN,
			ep_buf[endpoint].out_len);
	else
		SET_BDN(BDSnOUT(endpoint,0),
			BDNSTAT_UOWN|BDNSTAT_DTSEN,
			ep_buf[endpoint].out_len);

	ep_buf[endpoint].flags ^= EP_RX_DTS;
#endif

