JSnowden33/Wii-Bluetooth-Replacement/Software/PIC32/Wii_Bluetooth_Replacement.X/usb/usb.c
}

uint8_t usb_halt_ep_out(uint8_t ep)
{
	if (ep == 0 || ep > NUM_ENDPOINT_NUMBERS)
		return -1;

	ep_buf[ep].flags |= EP_OUT_HALT_FLAG;
	stall_ep_out(ep);

	return 0;
}

bool usb_out_endpoint_halted(uint8_t endpoint)
{
	return ep_buf[endpoint].flags & EP_OUT_HALT_FLAG;
}

void usb_start_receive_ep0_data_stage(char *buffer, size_t len,
                                      usb_ep0_data_stage_callback callback, void *context)
{
	reset_ep0_data_stage();

	ep0_data_stage_callback = callback;
	ep0_data_stage_out_buffer = buffer;
	ep0_data_stage_buf_remaining = len;
	ep0_data_stage_context = context;
}

void usb_send_data_stage(char *buffer, size_t len,
	usb_ep0_data_stage_callback callback, void *context)
{
	/* Start sending the first block. Subsequent blocks will be sent
	   when IN tokens are received on endpoint zero. */
	ep0_data_stage_callback = callback;
	ep0_data_stage_context = context;
	start_control_return(buffer, len, len);
}

/* Private Functions */

#ifdef USB_USE_INTERRUPTS
/* Manipulate the transaction (token) interrupt.  There is no stack or
 * counter used to keep track of enable/disable calls, so care must be used
 * to ensure that calls to these functions are not nested.  */
void usb_disable_transaction_interrupt()
{
	SFR_TRANSFER_IE = 0;
}
void usb_enable_transaction_interrupt()
{
	SFR_TRANSFER_IE = 1;
}
#endif


#ifdef USB_USE_INTERRUPTS
#ifdef __XC16__

void _ISR __attribute((auto_psv)) _USB1Interrupt()
{
	usb_service();
}

#elif __XC32__

/* No parameter for interrupt() means to use IPL=RIPL and to detect whether
   to use shadow registers or not. This is the safest option, but if a user
   wanted maximum performance, they could use IPL7SRS and set the USBIP to 7.
   IPL 7 is the only time the shadow register set can be used on PIC32MX. */
void __attribute__((vector(_USB_1_VECTOR), interrupt(), nomips16)) _USB1Interrupt()
{
	usb_service();
}

#elif __C18
#elif __XC8
	/* On these systems, interupt handlers are shared. An interrupt
	 * handler from the application must call usb_service(). */
#else
#error Compiler not supported yet
#endif
#endif